sin1111yi/ThetaRush/src/platform/STM32/platform/system/STM32H7xx/system_stm32h750xx.c
/**
 ******************************************************************************
 * @file    system_stm32h7xx.c
 * @author  MCD Application Team
 * @brief   CMSIS Cortex-Mx Device Peripheral Access Layer System Source File.
 *
 *   This file provides two functions and one global variable to be called from
 *   user application:
 *      - ExitRun0Mode(): Specifies the Power Supply source. This function is
 *                        called at startup just after reset and before the
 *call of SystemInit(). This call is made inside the "startup_stm32h7xx.s"
 *file.
 *
 *      - SystemInit(): This function is called at startup just after reset and
 *                      before branch to main program. This call is made inside
 *                      the "startup_stm32h7xx.s" file.
 *
 *      - SystemCoreClock variable: Contains the core clock, it can be used
 *                                  by the user application to setup the
 *SysTick timer or configure other parameters.
 *
 *      - SystemCoreClockUpdate(): Updates the variable SystemCoreClock and
 *must be called whenever the core clock is changed during program execution.
 *
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2017 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/** @addtogroup CMSIS
 * @{
 */

/** @addtogroup stm32h7xx_system
 * @{
 */

/** @addtogroup STM32H7xx_System_Private_Includes
 * @{
 */

#include "stm32h7xx.h"
#include <math.h>

#include "target.h"
#include "platform/memprot.h"

#if defined(STM32H750xx)

#if defined(__SYSTEM_STM32__)
#error "Compiling conflict system_stm32xx.c is not allowed."
#else
#define __SYSTEM_STM32__
#endif /* __SYSTEM_STM32__ */

#if !defined(HSE_VALUE)
#define HSE_VALUE                                                             \
  ((uint32_t)25000000) /*!< Value of the External oscillator in Hz */
#endif                 /* HSE_VALUE */

#if !defined(CSI_VALUE)
#define CSI_VALUE                                                             \
  ((uint32_t)4000000) /*!< Value of the Internal oscillator in Hz*/
#endif                /* CSI_VALUE */

#if !defined(HSI_VALUE)
#define HSI_VALUE                                                             \
  ((uint32_t)64000000) /*!< Value of the Internal oscillator in Hz*/
#endif                 /* HSI_VALUE */

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_TypesDefinitions
 * @{
 */

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_Defines
 * @{
 */

/************************* Miscellaneous Configuration
 * ************************/
/*!< Uncomment the following line if you need to use initialized data in D2
 * domain SRAM (AHB SRAM) */
/* #define DATA_IN_D2_SRAM */

/* Note: Following vector table addresses must be defined in line with linker
         configuration. */
/*!< Uncomment the following line if you need to relocate the vector table
     anywhere in FLASH BANK1 or AXI SRAM, else the vector table is kept at the
   automatic remap of boot address selected */
/* #define USER_VECT_TAB_ADDRESS */

#if defined(USER_VECT_TAB_ADDRESS)
#if defined(DUAL_CORE) && defined(CORE_CM4)
/*!< Uncomment the following line if you need to relocate your vector Table
     in D2 AXI SRAM else user remap will be done in FLASH BANK2. */
/* #define VECT_TAB_SRAM */
#if defined(VECT_TAB_SRAM)
#define VECT_TAB_BASE_ADDRESS                                                 \
  D2_AXISRAM_BASE /*!< Vector Table base address field.                       \
                       This value must be a multiple of 0x400. */
#define VECT_TAB_OFFSET                                                       \
  0x00000000U /*!< Vector Table base offset field.                            \
                   This value must be a multiple of 0x400. */
#else
#define VECT_TAB_BASE_ADDRESS                                                 \
  FLASH_BANK2_BASE /*!< Vector Table base address field.                      \
                        This value must be a multiple of 0x400. */
#define VECT_TAB_OFFSET                                                       \
  0x00000000U /*!< Vector Table base offset field.                            \
                   This value must be a multiple of 0x400. */
#endif        /* VECT_TAB_SRAM */
#else
/*!< Uncomment the following line if you need to relocate your vector Table
     in D1 AXI SRAM else user remap will be done in FLASH BANK1. */
/* #define VECT_TAB_SRAM */
#if defined(VECT_TAB_SRAM)
#define VECT_TAB_BASE_ADDRESS                                                 \
  D1_AXISRAM_BASE /*!< Vector Table base address field.                       \
                       This value must be a multiple of 0x400. */
#define VECT_TAB_OFFSET                                                       \
  0x00000000U /*!< Vector Table base offset field.                            \
                   This value must be a multiple of 0x400. */
#else
#define VECT_TAB_BASE_ADDRESS                                                 \
  FLASH_BANK1_BASE /*!< Vector Table base address field.                      \
                        This value must be a multiple of 0x400. */
#define VECT_TAB_OFFSET                                                       \
  0x00000000U /*!< Vector Table base offset field.                            \
                   This value must be a multiple of 0x400. */
#endif        /* VECT_TAB_SRAM */
#endif        /* DUAL_CORE && CORE_CM4 */
#endif        /* USER_VECT_TAB_ADDRESS */
/******************************************************************************/

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_Variables
 * @{
 */
/* This variable is updated in three ways:
    1) by calling CMSIS function SystemCoreClockUpdate()
    2) by calling HAL API function HAL_RCC_GetHCLKFreq()
    3) each time HAL_RCC_ClockConfig() is called to configure the system clock
   frequency Note: If you use this function to configure the system clock; then
   there is no need to call the 2 first functions listed above, since
   SystemCoreClock variable is updated automatically.
*/
uint32_t SystemCoreClock = 64000000;
uint32_t SystemD2Clock = 64000000;
const uint8_t D1CorePrescTable[16]
    = { 0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9 };

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_FunctionPrototypes
 * @{
 */

/**
 * @}
 */

/** @addtogroup STM32H7xx_System_Private_Functions
 * @{
 */

static void
Error_Handler (void)
{
  __disable_irq ();
  while (1)
    {
    }
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void
SystemClock_Config (void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
  RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

