sin1111yi/ThetaRush/src/platform/STM32/platform/system/STM32H7xx/system_stm32h750xx.c
  /** Supply configuration update enable
   */
  HAL_PWREx_ConfigSupply (PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG (PWR_REGULATOR_VOLTAGE_SCALE0);

  while (!__HAL_PWR_GET_FLAG (PWR_FLAG_VOSRDY))
    {
    }

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig (&RCC_OscInitStruct) != HAL_OK)
    {
      Error_Handler ();
    }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType
      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1
        | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig (&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
    {
      Error_Handler ();
    }
}

/**
 * @brief  Update SystemCoreClock variable according to Clock Register Values.
 *         The SystemCoreClock variable contains the core clock , it can
 *         be used by the user application to setup the SysTick timer or
 * configure other parameters.
 *
 * @note   Each time the core clock changes, this function must be called
 *         to update SystemCoreClock variable value. Otherwise, any
 * configuration based on this variable will be incorrect.
 *
 * @note   - The system frequency computed by this function is not the real
 *           frequency in the chip. It is calculated based on the predefined
 *           constant and the selected clock source:
 *
 *           - If SYSCLK source is CSI, SystemCoreClock will contain the
 * CSI_VALUE(*)
 *           - If SYSCLK source is HSI, SystemCoreClock will contain the
 * HSI_VALUE(**)
 *           - If SYSCLK source is HSE, SystemCoreClock will contain the
 * HSE_VALUE(***)
 *           - If SYSCLK source is PLL, SystemCoreClock will contain the
 * CSI_VALUE(*), HSI_VALUE(**) or HSE_VALUE(***) multiplied/divided by the PLL
 * factors.
 *
 *         (*) CSI_VALUE is a constant defined in stm32h7xx_hal.h file (default
 * value 4 MHz) but the real value may vary depending on the variations in
 * voltage and temperature.
 *         (**) HSI_VALUE is a constant defined in stm32h7xx_hal.h file
 * (default value 64 MHz) but the real value may vary depending on the
 * variations in voltage and temperature.
 *
 *         (***)HSE_VALUE is a constant defined in stm32h7xx_hal.h file
 * (default value 25 MHz), user has to ensure that HSE_VALUE is same as the
 * real frequency of the crystal used. Otherwise, this function may have wrong
 * result.
 *
 *         - The result of this function could be not correct when using
 * fractional value for HSE crystal.
 * @param  None
 * @retval None
 */
void
SystemCoreClockUpdate (void)
{
  uint32_t pllp, pllsource, pllm, pllfracen, hsivalue, tmp;
  uint32_t common_system_clock;
  float_t fracn1, pllvco;

  /* Get SYSCLK source
   * -------------------------------------------------------*/

  switch (RCC->CFGR & RCC_CFGR_SWS)
    {
    case RCC_CFGR_SWS_HSI: /* HSI used as system clock source */
      common_system_clock
          = (uint32_t)(HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> 3));
      break;

    case RCC_CFGR_SWS_CSI: /* CSI used as system clock  source */
      common_system_clock = CSI_VALUE;
      break;

    case RCC_CFGR_SWS_HSE: /* HSE used as system clock  source */
      common_system_clock = HSE_VALUE;
      break;

    case RCC_CFGR_SWS_PLL1: /* PLL1 used as system clock  source */

      /* PLL_VCO = (HSE_VALUE or HSI_VALUE or CSI_VALUE/ PLLM) * PLLN
      SYSCLK = PLL_VCO / PLLR
      */
      pllsource = (RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC);
      pllm = ((RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM1) >> 4);
      pllfracen = ((RCC->PLLCFGR & RCC_PLLCFGR_PLL1FRACEN)
                   >> RCC_PLLCFGR_PLL1FRACEN_Pos);
      fracn1 = (float_t)(uint32_t)(pllfracen
                                   * ((RCC->PLL1FRACR & RCC_PLL1FRACR_FRACN1)
                                      >> 3));

      if (pllm != 0U)
        {
          switch (pllsource)
            {
            case RCC_PLLCKSELR_PLLSRC_HSI: /* HSI used as PLL clock source */

              hsivalue = (HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> 3));
              pllvco = ((float_t)hsivalue / (float_t)pllm)
                       * ((float_t)(uint32_t)(RCC->PLL1DIVR & RCC_PLL1DIVR_N1)
                          + (fracn1 / (float_t)0x2000) + (float_t)1);

              break;

            case RCC_PLLCKSELR_PLLSRC_CSI: /* CSI used as PLL clock source */
              pllvco = ((float_t)CSI_VALUE / (float_t)pllm)
                       * ((float_t)(uint32_t)(RCC->PLL1DIVR & RCC_PLL1DIVR_N1)
                          + (fracn1 / (float_t)0x2000) + (float_t)1);
              break;

            case RCC_PLLCKSELR_PLLSRC_HSE: /* HSE used as PLL clock source */
              pllvco = ((float_t)HSE_VALUE / (float_t)pllm)
                       * ((float_t)(uint32_t)(RCC->PLL1DIVR & RCC_PLL1DIVR_N1)
                          + (fracn1 / (float_t)0x2000) + (float_t)1);
              break;

            default:
              hsivalue = (HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> 3));
              pllvco = ((float_t)hsivalue / (float_t)pllm)
                       * ((float_t)(uint32_t)(RCC->PLL1DIVR & RCC_PLL1DIVR_N1)
                          + (fracn1 / (float_t)0x2000) + (float_t)1);
              break;
            }
          pllp = (((RCC->PLL1DIVR & RCC_PLL1DIVR_P1) >> 9) + 1U);
          common_system_clock = (uint32_t)(float_t)(pllvco / (float_t)pllp);
        }
      else
        {
          common_system_clock = 0U;
        }
      break;

    default:
      common_system_clock
          = (uint32_t)(HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> 3));
      break;
    }

