sin1111yi/ThetaRush/src/platform/STM32/platform/system/STM32H7xx/system_stm32h750xx.c
    /* Compute SystemClock frequency
     * --------------------------------------------------*/
#if defined(RCC_D1CFGR_D1CPRE)
  tmp = D1CorePrescTable[(RCC->D1CFGR & RCC_D1CFGR_D1CPRE)
                         >> RCC_D1CFGR_D1CPRE_Pos];

  /* common_system_clock frequency : CM7 CPU frequency  */
  common_system_clock >>= tmp;

  /* SystemD2Clock frequency : CM4 CPU, AXI and AHBs Clock frequency  */
  SystemD2Clock = (common_system_clock
                   >> ((D1CorePrescTable[(RCC->D1CFGR & RCC_D1CFGR_HPRE)
                                         >> RCC_D1CFGR_HPRE_Pos])
                       & 0x1FU));

#else
  tmp = D1CorePrescTable[(RCC->CDCFGR1 & RCC_CDCFGR1_CDCPRE)
                         >> RCC_CDCFGR1_CDCPRE_Pos];

  /* common_system_clock frequency : CM7 CPU frequency  */
  common_system_clock >>= tmp;

  /* SystemD2Clock frequency : AXI and AHBs Clock frequency  */
  SystemD2Clock = (common_system_clock
                   >> ((D1CorePrescTable[(RCC->CDCFGR1 & RCC_CDCFGR1_HPRE)
                                         >> RCC_CDCFGR1_HPRE_Pos])
                       & 0x1FU));

#endif

#if defined(DUAL_CORE) && defined(CORE_CM4)
  SystemCoreClock = SystemD2Clock;
#else
  SystemCoreClock = common_system_clock;
#endif /* DUAL_CORE && CORE_CM4 */
}

/**
 * @brief  Setup the microcontroller system
 *         Initialize the FPU setting and  vector table location
 *         configuration.
 * @param  None
 * @retval None
 */
void
SystemInit (void)
{
#if defined(DATA_IN_D2_SRAM)
  __IO uint32_t tmpreg;
#endif /* DATA_IN_D2_SRAM */

/* FPU settings ------------------------------------------------------------*/
#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
  SCB->CPACR |= ((3UL << (10 * 2))
                 | (3UL << (11 * 2))); /* set CP10 and CP11 Full Access */
#endif
  /* Reset the RCC clock configuration to the default reset state
   * ------------*/

  /* Increasing the CPU frequency */
  if (FLASH_LATENCY_DEFAULT > (READ_BIT ((FLASH->ACR), FLASH_ACR_LATENCY)))
    {
      /* Program the new number of wait states to the LATENCY bits in the
       * FLASH_ACR register */
      MODIFY_REG (FLASH->ACR, FLASH_ACR_LATENCY,
                  (uint32_t)(FLASH_LATENCY_DEFAULT));
    }

  /* Set HSION bit */
  RCC->CR |= RCC_CR_HSION;

  /* Reset CFGR register */
  RCC->CFGR = 0x00000000;

  /* Reset HSEON, HSECSSON, CSION, HSI48ON, CSIKERON, PLL1ON, PLL2ON and PLL3ON
   * bits */
  RCC->CR &= 0xEAF6ED7FU;

  /* Decreasing the number of wait states because of lower CPU frequency */
  if (FLASH_LATENCY_DEFAULT < (READ_BIT ((FLASH->ACR), FLASH_ACR_LATENCY)))
    {
      /* Program the new number of wait states to the LATENCY bits in the
       * FLASH_ACR register */
      MODIFY_REG (FLASH->ACR, FLASH_ACR_LATENCY,
                  (uint32_t)(FLASH_LATENCY_DEFAULT));
    }

#if defined(D3_SRAM_BASE)
  /* Reset D1CFGR register */
  RCC->D1CFGR = 0x00000000;

  /* Reset D2CFGR register */
  RCC->D2CFGR = 0x00000000;

  /* Reset D3CFGR register */
  RCC->D3CFGR = 0x00000000;
#else
  /* Reset CDCFGR1 register */
  RCC->CDCFGR1 = 0x00000000;

  /* Reset CDCFGR2 register */
  RCC->CDCFGR2 = 0x00000000;

  /* Reset SRDCFGR register */
  RCC->SRDCFGR = 0x00000000;
#endif
  /* Reset PLLCKSELR register */
  RCC->PLLCKSELR = 0x02020200;

  /* Reset PLLCFGR register */
  RCC->PLLCFGR = 0x01FF0000;
  /* Reset PLL1DIVR register */
  RCC->PLL1DIVR = 0x01010280;
  /* Reset PLL1FRACR register */
  RCC->PLL1FRACR = 0x00000000;

  /* Reset PLL2DIVR register */
  RCC->PLL2DIVR = 0x01010280;

  /* Reset PLL2FRACR register */

  RCC->PLL2FRACR = 0x00000000;
  /* Reset PLL3DIVR register */
  RCC->PLL3DIVR = 0x01010280;

  /* Reset PLL3FRACR register */
  RCC->PLL3FRACR = 0x00000000;

  /* Reset HSEBYP bit */
  RCC->CR &= 0xFFFBFFFFU;

  /* Disable all interrupts */
  RCC->CIER = 0x00000000;

#if (STM32H7_DEV_ID == 0x450UL)
  /* dual core CM7 or single core line */
  if ((DBGMCU->IDCODE & 0xFFFF0000U) < 0x20000000U)
    {
      /* if stm32h7 revY*/
      /* Change  the switch matrix read issuing capability to 1 for the AXI
       * SRAM target (Target 7) */
      *((__IO uint32_t *)0x51008108) = 0x000000001U;
    }
#endif /* STM32H7_DEV_ID */

#if defined(DATA_IN_D2_SRAM)
    /* in case of initialized data in D2 SRAM (AHB SRAM), enable the D2 SRAM
     * clock (AHB SRAM clock) */
#if defined(RCC_AHB2ENR_D2SRAM3EN)
  RCC->AHB2ENR |= (RCC_AHB2ENR_D2SRAM1EN | RCC_AHB2ENR_D2SRAM2EN
                   | RCC_AHB2ENR_D2SRAM3EN);
#elif defined(RCC_AHB2ENR_D2SRAM2EN)
  RCC->AHB2ENR |= (RCC_AHB2ENR_D2SRAM1EN | RCC_AHB2ENR_D2SRAM2EN);
#else
  RCC->AHB2ENR |= (RCC_AHB2ENR_AHBSRAM1EN | RCC_AHB2ENR_AHBSRAM2EN);
#endif /* RCC_AHB2ENR_D2SRAM3EN */

  tmpreg = RCC->AHB2ENR;
  (void)tmpreg;
#endif /* DATA_IN_D2_SRAM */

#if defined(DUAL_CORE) && defined(CORE_CM4)
  /* Configure the Vector Table location add offset address for cortex-M4
   * ------------------*/
#if defined(USER_VECT_TAB_ADDRESS)
  SCB->VTOR = VECT_TAB_BASE_ADDRESS
              | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal D2
                                    AXI-RAM or in Internal FLASH */
#endif                           /* USER_VECT_TAB_ADDRESS */

#else
  if (READ_BIT (RCC->AHB3ENR, RCC_AHB3ENR_FMCEN) == 0U)
    {
      /* Enable the FMC interface clock */
      SET_BIT (RCC->AHB3ENR, RCC_AHB3ENR_FMCEN);

      /*
       * Disable the FMC bank1 (enabled after reset).
       * This, prevents CPU speculation access on this bank which blocks the
       * use of FMC during 24us. During this time the others FMC master (such
       * as LTDC) cannot use it!
       */
      FMC_Bank1_R->BTCR[0] = 0x000030D2;

      /* Disable the FMC interface clock */
      CLEAR_BIT (RCC->AHB3ENR, RCC_AHB3ENR_FMCEN);
    }

    /* Configure the Vector Table location
     * -------------------------------------*/
#if defined(USER_VECT_TAB_ADDRESS)
  SCB->VTOR = VECT_TAB_BASE_ADDRESS
              | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal D1
                                    AXI-RAM or in Internal FLASH */
#endif /* USER_VECT_TAB_ADDRESS */

#ifdef USE_HAL_DRIVER
  HAL_Init ();
#endif

