sin1111yi/ThetaRush/src/platform/STM32/platform/system/STM32H7xx/system_stm32h750xx.c
  SystemClock_Config ();
  SystemCoreClockUpdate ();

    // Configure MPU

  memProtConfigure(mpuRegions, mpuRegionCount);

  // Enable CPU L1-Cache
  SCB_EnableICache ();
  SCB_EnableDCache ();

#endif /*DUAL_CORE && CORE_CM4*/
}

/**
 * @brief  Exit Run* mode and Configure the system Power Supply
 *
 * @note   This function exits the Run* mode and configures the system power
 * supply according to the definition to be used at compilation preprocessing
 * level. The application shall set one of the following configuration option:
 *           - PWR_LDO_SUPPLY
 *           - PWR_DIRECT_SMPS_SUPPLY
 *           - PWR_EXTERNAL_SOURCE_SUPPLY
 *           - PWR_SMPS_1V8_SUPPLIES_LDO
 *           - PWR_SMPS_2V5_SUPPLIES_LDO
 *           - PWR_SMPS_1V8_SUPPLIES_EXT_AND_LDO
 *           - PWR_SMPS_2V5_SUPPLIES_EXT_AND_LDO
 *           - PWR_SMPS_1V8_SUPPLIES_EXT
 *           - PWR_SMPS_2V5_SUPPLIES_EXT
 *
 * @note   The function modifies the PWR->CR3 register to enable or disable
 * specific power supply modes and waits until the voltage level flag is set,
 * indicating that the power supply configuration is stable.
 *
 * @param  None
 * @retval None
 */
void
ExitRun0Mode (void)
{
#if defined(USE_PWR_LDO_SUPPLY)
#if defined(SMPS)
  /* Exit Run* mode by disabling SMPS and enabling LDO */
  PWR->CR3 = (PWR->CR3 & ~PWR_CR3_SMPSEN) | PWR_CR3_LDOEN;
#else
  /* Enable LDO mode */
  PWR->CR3 |= PWR_CR3_LDOEN;
#endif /* SMPS */
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_EXTERNAL_SOURCE_SUPPLY)
#if defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 = (PWR->CR3 & ~(PWR_CR3_SMPSEN | PWR_CR3_LDOEN)) | PWR_CR3_BYPASS;
#else
  PWR->CR3 = (PWR->CR3 & ~(PWR_CR3_LDOEN)) | PWR_CR3_BYPASS;
#endif /* SMPS */
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_DIRECT_SMPS_SUPPLY) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 &= ~(PWR_CR3_LDOEN);
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_1V8_SUPPLIES_LDO) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 |= PWR_CR3_SMPSLEVEL_0 | PWR_CR3_SMPSEN | PWR_CR3_LDOEN;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_2V5_SUPPLIES_LDO) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 |= PWR_CR3_SMPSLEVEL_1 | PWR_CR3_SMPSEN | PWR_CR3_LDOEN;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_1V8_SUPPLIES_EXT_AND_LDO) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 |= PWR_CR3_SMPSLEVEL_0 | PWR_CR3_SMPSEXTHP | PWR_CR3_SMPSEN
              | PWR_CR3_LDOEN;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_2V5_SUPPLIES_EXT_AND_LDO) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 |= PWR_CR3_SMPSLEVEL_1 | PWR_CR3_SMPSEXTHP | PWR_CR3_SMPSEN
              | PWR_CR3_LDOEN;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_1V8_SUPPLIES_EXT) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 = (PWR->CR3 & ~(PWR_CR3_LDOEN)) | PWR_CR3_SMPSLEVEL_0
             | PWR_CR3_SMPSEXTHP | PWR_CR3_SMPSEN | PWR_CR3_BYPASS;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#elif defined(USE_PWR_SMPS_2V5_SUPPLIES_EXT) && defined(SMPS)
  /* Exit Run* mode */
  PWR->CR3 = (PWR->CR3 & ~(PWR_CR3_LDOEN)) | PWR_CR3_SMPSLEVEL_1
             | PWR_CR3_SMPSEXTHP | PWR_CR3_SMPSEN | PWR_CR3_BYPASS;
  /* Wait till voltage level flag is set */
  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0U)
    {
    }
#else
  /* No system power supply configuration is selected at exit Run* mode */
#endif /* USE_PWR_LDO_SUPPLY */
}

#endif /* STM32H750xx */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
